src/Documents/ПлатежноеПоручениеИсходящее/ПлатежноеПоручениеИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручениеИсходящее</name>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Пост</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПлатежноеПоручениеИсходящее/ManagerModule.bsl
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	// сформироватьВзаиморасчеты ( Данные );
	сформироватьДенежныеСредства ( Данные );
	сформироватьДвиженияДенежныхСредств ( Данные );
	// сформироватьДоходыРасходы ( Данные );
	установитьФлагиЗаписи ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|ВЫБРАТЬ Ссылка КАК Ссылка, Номер КАК Номер, Дата КАК Период, ДатаОперации КАК ДатаОперации,
	|		 Счет КАК Счет, Контрагент КАК Контрагент, НазначениеПлатежа КАК НазначениеПлатежа,
	|		 НомерКвитанции КАК НомерКвитанции, Основание КАК Основание, Пост КАК Пост, Сумма КАК Сумма, 
	|		 Валюта КАК Валюта, Организация КАК Организация, СуммаПлатежа КАК СуммаПлатежа, СуммаКомиссии КАК СуммаКомиссии,
	|		 СтатьяДДС КАК СтатьяДДС 
	|ИЗ 	 Документ.ПлатежноеПоручениеИсходящее
	|ГДЕ	 Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.Выполнить ();
	выборкаШапка = результат.Выбрать ();
	выборкаШапка.Следующий ();
	Данные.Вставить ( "Шапка", выборкаШапка );

КонецПроцедуры

Процедура сформироватьВзаиморасчеты ( Данные )
	
	движение = Данные.Движения.Взаиморасчеты.ДобавитьПриход ();
	движение.Период = Данные.Шапка.Период;
	движение.Контрагент = Данные.Шапка.Контрагент;
	движение.Организация = Данные.Шапка.Организация;
	движение.Заявка = Данные.Шапка.Заявка;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Сумма = Данные.Шапка.СуммаПлатежа;
	
КонецПроцедуры

Процедура сформироватьДоходыРасходы ( Данные )
	
	Если ( Данные.Шапка.СуммаКомиссии = 0 ) Тогда
		Возврат;
	КонецЕсли; 
	движение = Данные.Движения.ДоходыРасходы.Добавить ();
	движение.Период = Данные.Шапка.Период;
	движение.Заявка = Данные.Шапка.Заявка;
	движение.Номенклатура = Справочники.Номенклатура.КомиссияБанка;
	движение.СуммаРасход = Данные.Шапка.СуммаКомиссии;
	
КонецПроцедуры

Процедура сформироватьДенежныеСредства ( Данные )
	
	движение = Данные.Движения.ДенежныеСредства.ДобавитьРасход ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.Счет;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Сумма = Данные.Шапка.Сумма;
	
КонецПроцедуры

Процедура сформироватьДвиженияДенежныхСредств ( Данные )
	
	движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.Счет;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Организация = Данные.Шапка.Организация;
	движение.СтатьяДДС = Данные.Шапка.СтатьяДДС;
	движение.СуммаРасход = Данные.Шапка.Сумма;
	движение.СуммаПриход = 0;
	
КонецПроцедуры

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.Взаиморасчеты.Записывать = ИСТИНА;
	Данные.Движения.ДенежныеСредства.Записывать = ИСТИНА;
	Данные.Движения.ДоходыРасходы.Записывать = ИСТИНА;
	Данные.Движения.ДвиженияДенежныхСредств.Записывать = ИСТИНА;
	
КонецПроцедуры
